## Pandas DataFrame Ozellikleri & Olusturma

In [274]:
import numpy as np
import pandas as pd

In [275]:
l = [1,4,577,343]
l

[1, 4, 577, 343]

In [276]:
pd.DataFrame(l,columns = ['degisken_ismi'])

   degisken_ismi
0              1
1              4
2            577
3            343

In [277]:
df =pd.DataFrame(l,columns = ['degisken_ismi'])

In [278]:
type(df)

pandas.core.frame.DataFrame

In [279]:
df.axes

[RangeIndex(start=0, stop=4, step=1), Index(['degisken_ismi'], dtype='object')]

In [280]:
df.shape

(4, 1)

In [281]:
df.ndim

2

In [282]:
df.size

4

In [283]:
df.values

array([[  1],
       [  4],
       [577],
       [343]], dtype=int64)

In [284]:
df.head(2)

   degisken_ismi
0              1
1              4

In [285]:
df.tail(3)

   degisken_ismi
1              4
2            577
3            343

In [286]:
a =np.array ([1,2,3,4,56])

In [287]:
pd.DataFrame (a, columns = ['Degisken_Ismi'])

   Degisken_Ismi
0              1
1              2
2              3
3              4
4             56

In [288]:
a = np.arange(1,10).reshape((3,3))
a

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [289]:
df =pd.DataFrame (a, columns = ['var1','var2','var3'])
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [290]:
df.columns = ('deg1','deg2','deg3')
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [291]:
df =pd.DataFrame (a, columns = ['var1','var2','var3'], index = ['a','b','c'])
df

   var1  var2  var3
a     1     2     3
b     4     5     6
c     7     8     9

In [292]:
pd.Series ([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [293]:
pd.DataFrame(pd.Series ([1,2,3,4]),columns = ['degisken'])

   degisken
0         1
1         2
2         3
3         4

In [294]:
bir = pd.Series ([1,2,3,4])
iki = pd.Series ([1,2,3,4])

In [295]:
pd.DataFrame ({'degisken1': bir , 'degisken2' : iki})

   degisken1  degisken2
0          1          1
1          2          2
2          3          3
3          4          4

In [296]:
sozluk = {"reg" : {"RMSE": 10,
                    "MSE": 11,
                    "SSE": 90},
          
           "loj" : {"RMSE": 89,
                    "MSE": 12,
                    "SSE": 45},
                    
          "cart": {"RMSE": 45,
                    "MSE": 22,
                    "SSE": 11}}

In [297]:
pd.DataFrame(sozluk)

      reg  loj  cart
RMSE   10   89    45
MSE    11   12    22
SSE    90   45    11

## DataFrame eleman islemler

In [298]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

df = pd.DataFrame({"var1": s1, "var2": s2,"var3": s3})
df

   var1  var2  var3
0     2     9     0
1     2     5     5
2     7     4     1
3     6     1     2
4     6     1     9

In [299]:
df[0:1]

   var1  var2  var3
0     2     9     0

In [300]:
df.index = ['a','b','c','d','e']
df

   var1  var2  var3
a     2     9     0
b     2     5     5
c     7     4     1
d     6     1     2
e     6     1     9

In [301]:
df['c':'e']

   var1  var2  var3
c     7     4     1
d     6     1     2
e     6     1     9

In [302]:
df.drop('a',axis= 0)

   var1  var2  var3
b     2     5     5
c     7     4     1
d     6     1     2
e     6     1     9

In [303]:
df

   var1  var2  var3
a     2     9     0
b     2     5     5
c     7     4     1
d     6     1     2
e     6     1     9

In [304]:
df.drop('a',axis= 0, inplace= True)

In [305]:
df

   var1  var2  var3
b     2     5     5
c     7     4     1
d     6     1     2
e     6     1     9

In [306]:
l = ['b','c']
l

['b', 'c']

In [307]:
df.drop (l,axis = 0)

   var1  var2  var3
d     6     1     2
e     6     1     9

In [308]:
df

   var1  var2  var3
b     2     5     5
c     7     4     1
d     6     1     2
e     6     1     9

In [309]:
'var1' in df

True

In [310]:
l = ['var1','var2','var4']
l

['var1', 'var2', 'var4']

In [311]:
for i in l :
    print(i in df)

True
True
False

In [312]:
df [ 'var1'] is df['var2']

False

In [313]:
df['var2']

b    5
c    4
d    1
e    1
Name: var2, dtype: int32

In [314]:
df.var2

b    5
c    4
d    1
e    1
Name: var2, dtype: int32

In [315]:
df[['var1','var2']]

   var1  var2
b     2     5
c     7     4
d     6     1
e     6     1

In [316]:
l = ['var1','var2']

In [317]:
df[l]

   var1  var2
b     2     5
c     7     4
d     6     1
e     6     1

In [318]:
df

   var1  var2  var3
b     2     5     5
c     7     4     1
d     6     1     2
e     6     1     9

In [319]:
df['var4'] = df['var1'] / df['var2']

In [320]:
df

   var1  var2  var3  var4
b     2     5     5  0.40
c     7     4     1  1.75
d     6     1     2  6.00
e     6     1     9  6.00

In [321]:
df.drop('var4',axis=1)

   var1  var2  var3
b     2     5     5
c     7     4     1
d     6     1     2
e     6     1     9

In [322]:
df

   var1  var2  var3  var4
b     2     5     5  0.40
c     7     4     1  1.75
d     6     1     2  6.00
e     6     1     9  6.00

In [323]:
df.drop('var4',axis=1,inplace = True)
df

   var1  var2  var3
b     2     5     5
c     7     4     1
d     6     1     2
e     6     1     9

In [324]:
df.drop(l,axis=1) #  l = ['var1','var2']

   var3
b     5
c     1
d     2
e     9

## Gozlem ve Degiskenlere Birlikte Erismek

In [325]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

df = pd.DataFrame({"var1": s1, "var2": s2,"var3": s3})
df

   var1  var2  var3
0     0     7     6
1     6     0     9
2     3     1     0
3     4     6     3
4     0     9     4

In [326]:
df.loc[0:3]

   var1  var2  var3
0     0     7     6
1     6     0     9
2     3     1     0
3     4     6     3

In [327]:
df.iloc[0:3]

   var1  var2  var3
0     0     7     6
1     6     0     9
2     3     1     0

In [328]:
df.iloc[0,0]

0

In [329]:
df.iloc[:3,:2]

   var1  var2
0     0     7
1     6     0
2     3     1

In [330]:
df.iloc[2:6,1:3]

   var2  var3
2     1     0
3     6     3
4     9     4

In [331]:
df.loc[0:3,'var3']

0    6
1    9
2    0
3    3
Name: var3, dtype: int32

In [332]:
df.loc[0:3,'var2':'var3']  # hem satir hem sutun isim verilir

   var2  var3
0     7     6
1     0     9
2     1     0
3     6     3

In [333]:
df.iloc[0:3,1:3] # hem satir hem sutun numaralari

   var2  var3
0     7     6
1     0     9
2     1     0

In [334]:
df

   var1  var2  var3
0     0     7     6
1     6     0     9
2     3     1     0
3     4     6     3
4     0     9     4

In [335]:
df.index = ['a','b','c','d','e']
df

   var1  var2  var3
a     0     7     6
b     6     0     9
c     3     1     0
d     4     6     3
e     0     9     4

In [336]:
df.loc['c':'d','var2':'var3']

   var2  var3
c     1     0
d     6     3

In [337]:
df

   var1  var2  var3
a     0     7     6
b     6     0     9
c     3     1     0
d     4     6     3
e     0     9     4

In [338]:
df[df.var1>5]

   var1  var2  var3
b     6     0     9

In [339]:
df[df.var1>5]['var2']

b    0
Name: var2, dtype: int32

In [340]:
df[(df.var1>5) & (df.var3 <2)]

Empty DataFrame
Columns: [var1, var2, var3]
Index: []

In [341]:
df.loc[df.var1>5,['var1','var2']]

   var1  var2
b     6     0

## Birlestirme (JOIN) Islemleri

In [342]:
s1 = np.random.randint(10,size = 5)
s2 = np.random.randint(10,size = 5)
s3 = np.random.randint(10,size = 5)

df1 = pd.DataFrame({'var1':s1,'var2':s2,'var3':s3})
df1

   var1  var2  var3
0     0     3     4
1     4     4     9
2     3     0     3
3     6     6     8
4     3     1     0

In [343]:
df2 = df1 +99
df2

   var1  var2  var3
0    99   102   103
1   103   103   108
2   102    99   102
3   105   105   107
4   102   100    99

In [344]:
pd.concat([df1,df2])

   var1  var2  var3
0     0     3     4
1     4     4     9
2     3     0     3
3     6     6     8
4     3     1     0
0    99   102   103
1   103   103   108
2   102    99   102
3   105   105   107
4   102   100    99

In [345]:
pd.concat([df1,df2], axis=1)

   var1  var2  var3  var1  var2  var3
0     0     3     4    99   102   103
1     4     4     9   103   103   108
2     3     0     3   102    99   102
3     6     6     8   105   105   107
4     3     1     0   102   100    99

In [346]:
pd.concat([df1,df2],ignore_index = True)

   var1  var2  var3
0     0     3     4
1     4     4     9
2     3     0     3
3     6     6     8
4     3     1     0
5    99   102   103
6   103   103   108
7   102    99   102
8   105   105   107
9   102   100    99

In [347]:
df2.columns = ['var1','var2','deg3']
df2

   var1  var2  deg3
0    99   102   103
1   103   103   108
2   102    99   102
3   105   105   107
4   102   100    99

In [348]:
df1

   var1  var2  var3
0     0     3     4
1     4     4     9
2     3     0     3
3     6     6     8
4     3     1     0

In [349]:
pd.concat([df1,df2])

C:\Users\Surface\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    deg3  var1  var2  var3
0    NaN     0     3   4.0
1    NaN     4     4   9.0
2    NaN     3     0   3.0
3    NaN     6     6   8.0
4    NaN     3     1   0.0
0  103.0    99   102   NaN
1  108.0   103   103   NaN
2  102.0   102    99   NaN
3  107.0   105   105   NaN
4   99.0   102   100   NaN

In [350]:
pd.concat([df1,df2], join ='inner')

   var1  var2
0     0     3
1     4     4
2     3     0
3     6     6
4     3     1
0    99   102
1   103   103
2   102    99
3   105   105
4   102   100

In [351]:
pd.concat([df1,df2], join_axes =[df1.columns])

C:\Users\Surface\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

   var1  var2  var3
0     0     3   4.0
1     4     4   9.0
2     3     0   3.0
3     6     6   8.0
4     3     1   0.0
0    99   102   NaN
1   103   103   NaN
2   102    99   NaN
3   105   105   NaN
4   102   100   NaN

In [352]:
pd.concat([df1,df2], ignore_index = 'True').reindex(columns=df2.columns)

C:\Users\Surface\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   var1  var2   deg3
0     0     3    NaN
1     4     4    NaN
2     3     0    NaN
3     6     6    NaN
4     3     1    NaN
5    99   102  103.0
6   103   103  108.0
7   102    99  102.0
8   105   105  107.0
9   102   100   99.0

In [353]:
# Merge Join

In [354]:
df1 = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'grup': ['Muhasebe', 'Muhendislik', 'Muhendislik', 'K']})

df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           K

In [355]:
df2 = pd.DataFrame({'calisanlar': ['Ayse', 'Ali', 'Veli', 'Fatma'],
                    'ilk_giris': [2010, 2009, 2014, 2019]})

df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [356]:
df4 = pd.DataFrame({'grup': ['Muhasebe', 'Muhendislik', 'K'],
                    'mudur': ['Caner', 'Mustafa', 'Berkcan']})

df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           K  Berkcan

In [357]:
df5 = pd.DataFrame({'grup': ['Muhasebe', 'Muhasebe',
                              'Muhendislik', 'Muhendislik', 'K', 'K'],
                    'yetenekler': ['matematik', 'excel', 'kodlama', 'linux',
                               'excel', 'yonetim']})

df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           K      excel
5           K    yonetim

In [358]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           K       2019

In [359]:
pd.merge(df1,df2,on ='calisanlar')

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           K       2019

In [360]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           K       2019

In [361]:
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           K  Berkcan

In [362]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           K       2019  Berkcan

In [363]:
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           K      excel
5           K    yonetim

In [364]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           K

In [365]:
pd.merge(df1,df5) # many to many

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           K      excel
7      Fatma           K    yonetim

In [366]:
df3 = pd.DataFrame({'name': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'maas': [70000, 80000, 120000, 90000]})

df3

    name    maas
0    Ali   70000
1   Veli   80000
2   Ayse  120000
3  Fatma   90000

In [367]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           K

In [418]:
pd.merge(df1,df3, left_on='calisanlar',right_on ='name')

  calisanlar         grup   name    maas
0        Ali     Muhasebe    Ali   70000
1       Veli  Muhendislik   Veli   80000
2       Ayse  Muhendislik   Ayse  120000
3      Fatma           K  Fatma   90000

In [ ]:
pd.merge(df1,df3, left_on='calisanlar',right_on ='name').drop('name',axis=1)

In [369]:
df1a =df1.set_index('calisanlar')
df1a

                   grup
calisanlar
Ali            Muhasebe
Veli        Muhendislik
Ayse        Muhendislik
Fatma                K

In [370]:
df2a = df2.set_index('calisanlar')
df2a

            ilk_giris
calisanlar
Ayse             2010
Ali              2009
Veli             2014
Fatma            2019

In [371]:
pd.merge(df1a,df2a,left_index=True,right_index=True)

                   grup  ilk_giris
calisanlar
Ali            Muhasebe       2009
Veli        Muhendislik       2014
Ayse        Muhendislik       2010
Fatma                K       2019

In [372]:
df1a.join(df2a)

                   grup  ilk_giris
calisanlar
Ali            Muhasebe       2009
Veli        Muhendislik       2014
Ayse        Muhendislik       2010
Fatma                K       2019

In [373]:
# overlapping

In [374]:
dfa = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'siralama': [1, 2, 3, 4]})

dfa

  calisanlar  siralama
0        Ali         1
1       Veli         2
2       Ayse         3
3      Fatma         4

In [375]:
dfb = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'siralama': [3, 1, 4, 2]})

dfb

  calisanlar  siralama
0        Ali         3
1       Veli         1
2       Ayse         4
3      Fatma         2

In [376]:
pd.merge(dfa,dfb,on = 'calisanlar')

  calisanlar  siralama_x  siralama_y
0        Ali           1           3
1       Veli           2           1
2       Ayse           3           4
3      Fatma           4           2

In [377]:
pd.merge(dfa,dfb,on='calisanlar',suffixes=['_Maas','_Deneyim'])

  calisanlar  siralama_Maas  siralama_Deneyim
0        Ali              1                 3
1       Veli              2                 1
2       Ayse              3                 4
3      Fatma              4                 2

## Agregation ve Gruplama Islemleri

In [378]:
import seaborn as sns

In [379]:
df = sns.load_dataset('planets')
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [380]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [381]:
df.shape

(1035, 6)

In [382]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [383]:
df['mass'].count()

513

In [384]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

count()

first()

last()

mean()

median()

min()

max()

std()

var()

In [385]:
df['mass'].describe()

count    513.000000
mean       2.638161
std        3.818617
min        0.003600
25%        0.229000
50%        1.260000
75%        3.040000
max       25.000000
Name: mass, dtype: float64

In [386]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [387]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

## Gruplama lemleri

In [388]:
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'veri': [10,11,52,23,43,55]}, columns=['gruplar', 'veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [389]:
df.groupby('gruplar')

In [390]:
df.groupby('gruplar').sum()

         veri
gruplar
A          33
B          54
C         107

In [391]:
df = sns.load_dataset('planets')
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [392]:
df.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [393]:
df.groupby('method')['orbital_period'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

## Agregate , filter, transform,apply

In [394]:
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])

df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [395]:
df.groupby('gruplar').aggregate(['min',np.median,'max'])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [396]:
df.groupby('gruplar').aggregate({'degisken1':'min','degisken2':'max'})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [397]:
def filter_func(x):
    return x['degisken1'].std()>10

In [398]:
df.groupby('gruplar').filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [399]:
df.groupby('gruplar').transform(lambda x : x - x.mean())

   degisken1  degisken2
0       -6.0      -81.0
1        6.0       71.0
2      -33.0     -318.0
3        6.0       81.0
4       -6.0      -71.0
5       33.0      318.0

In [400]:
df.groupby('gruplar').apply(np.sum)
df.groupby('gruplar').apply(np.mean)

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [401]:
df.groupby(df['gruplar']).sum()

         degisken1  degisken2
gruplar
A               32        362
B               34        364
C              132       1302

In [402]:
L = [0,1,0,1,2,0]

In [403]:
df.groupby(L).sum()

   degisken1  degisken2
0        142       1402
1         45        515
2         11        111

In [404]:
df.groupby(df['gruplar']).sum()

         degisken1  degisken2
gruplar
A               32        362
B               34        364
C              132       1302

## Pivot Tablolar

In [405]:
import pandas as pd
import seaborn as sns
df = sns.load_dataset('titanic')

df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [406]:
df.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [407]:
df.groupby(['sex','class'])['survived'].aggregate('mean')

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [408]:
df.groupby(['sex','class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [409]:
df.pivot_table('survived',index='sex',columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [410]:
age = pd.cut(df['age'],[0,18,90])
age.head()

0    (18, 90]
1    (18, 90]
2    (18, 90]
3    (18, 90]
4    (18, 90]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [411]:
df.pivot_table('survived',['sex',age],'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

In [412]:
fare = pd.qcut(df['fare'],2)
fare.head()

0     (-0.001, 14.454]
1    (14.454, 512.329]
2     (-0.001, 14.454]
3    (14.454, 512.329]
4     (-0.001, 14.454]
Name: fare, dtype: category
Categories (2, interval[float64]): [(-0.001, 14.454] < (14.454, 512.329]]

In [413]:
df.pivot_table('survived',['sex',age],[fare,'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 90]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 90]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 90]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 90]  0.030303  0.192308

In [414]:
df.pivot_table(index='sex',columns='class',aggfunc= {'survived': sum,'fare': 'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

In [415]:
df.pivot_table('survived',index='sex',columns='class',margins = True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

In [416]:
pwd

'C:\\Users\\Surface\\Desktop\\python_programlama\\veri_manipulasyonu_calismalar'

In [417]:
|

SyntaxError: invalid syntax (<ipython-input-417-4b37ef281455>, line 1)